import styles from "../styles/index.module.scss";

const Content = () => {
  return (
    <ul className={styles.contents}>
      {/* 출처 : http://guny.kr/stuff/klorem/ */}
      <li>
        국정의 중요한 사항에 관한 대통령의 자문에 응하기 위하여 국가원로로
        구성되는 국가원로자문회의를 둘 수 있다. 대통령은 국민의
        보통·평등·직접·비밀선거에 의하여 선출한다.
      </li>
      <li>
        국회의원은 국회에서 직무상 행한 발언과 표결에 관하여 국회외에서 책임을
        지지 아니한다. 대통령의 임기가 만료되는 때에는 임기만료 70일 내지
        40일전에 후임자를 선거한다.
      </li>
      <li>
        언론·출판에 대한 허가나 검열과 집회·결사에 대한 허가는 인정되지
        아니한다. 공개하지 아니한 회의내용의 공표에 관하여는 법률이 정하는 바에
        의한다.
      </li>
      <li>
        제1항의 해임건의는 국회재적의원 3분의 1 이상의 발의에 의하여
        국회재적의원 과반수의 찬성이 있어야 한다. 대한민국의 경제질서는 개인과
        기업의 경제상의 자유와 창의를 존중함을 기본으로 한다.
      </li>
      <li>
        대법원장과 대법관이 아닌 법관의 임기는 10년으로 하며, 법률이 정하는 바에
        의하여 연임할 수 있다. 대통령의 임기연장 또는 중임변경을 위한 헌법개정은
        그 헌법개정 제안 당시의 대통령에 대하여는 효력이 없다.
      </li>
      <li>
        제3항의 승인을 얻지 못한 때에는 그 처분 또는 명령은 그때부터 효력을
        상실한다. 이 경우 그 명령에 의하여 개정 또는 폐지되었던 법률은 그 명령이
        승인을 얻지 못한 때부터 당연히 효력을 회복한다.
      </li>
      <li>
        교육의 자주성·전문성·정치적 중립성 및 대학의 자율성은 법률이 정하는 바에
        의하여 보장된다. 언론·출판은 타인의 명예나 권리 또는 공중도덕이나
        사회윤리를 침해하여서는 아니된다. 언론·출판이 타인의 명예나 권리를
        침해한 때에는 피해자는 이에 대한 피해의 배상을 청구할 수 있다.
      </li>
      <li>
        헌법재판소의 장은 국회의 동의를 얻어 재판관중에서 대통령이 임명한다.
        감사위원은 원장의 제청으로 대통령이 임명하고, 그 임기는 4년으로 하며,
        1차에 한하여 중임할 수 있다.
      </li>
      <li>
        대법원장과 대법관이 아닌 법관은 대법관회의의 동의를 얻어 대법원장이
        임명한다. 누구든지 체포 또는 구속을 당한 때에는 즉시 변호인의 조력을
        받을 권리를 가진다. 다만, 형사피고인이 스스로 변호인을 구할 수 없을
        때에는 법률이 정하는 바에 의하여 국가가 변호인을 붙인다.
      </li>
      <li>
        모든 국민은 근로의 의무를 진다. 국가는 근로의 의무의 내용과 조건을
        민주주의원칙에 따라 법률로 정한다. 국가는 농지에 관하여 경자유전의
        원칙이 달성될 수 있도록 노력하여야 하며, 농지의 소작제도는 금지된다.
      </li>
      <li>
        대통령이 궐위되거나 사고로 인하여 직무를 수행할 수 없을 때에는 국무총리,
        법률이 정한 국무위원의 순서로 그 권한을 대행한다. 국무위원은 국정에
        관하여 대통령을 보좌하며, 국무회의의 구성원으로서 국정을 심의한다.
      </li>
      <li>
        헌법개정안이 제2항의 찬성을 얻은 때에는 헌법개정은 확정되며, 대통령은
        즉시 이를 공포하여야 한다. 국가는 건전한 소비행위를 계도하고 생산품의
        품질향상을 촉구하기 위한 소비자보호운동을 법률이 정하는 바에 의하여
        보장한다.
      </li>
      <li>
        국회에 제출된 법률안 기타의 의안은 회기중에 의결되지 못한 이유로
        폐기되지 아니한다. 다만, 국회의원의 임기가 만료된 때에는 그러하지
        아니하다. 정당의 목적이나 활동이 민주적 기본질서에 위배될 때에는 정부는
        헌법재판소에 그 해산을 제소할 수 있고, 정당은 헌법재판소의 심판에 의하여
        해산된다.
      </li>
      <li>
        국가는 농업 및 어업을 보호·육성하기 위하여 농·어촌종합개발과 그 지원등
        필요한 계획을 수립·시행하여야 한다. 제2항의 재판관중 3인은 국회에서
        선출하는 자를, 3인은 대법원장이 지명하는 자를 임명한다.
      </li>
      <li>
        헌법재판소 재판관은 탄핵 또는 금고 이상의 형의 선고에 의하지 아니하고는
        파면되지 아니한다. 국회의원의 수는 법률로 정하되, 200인 이상으로 한다.
      </li>
      <li>
        제2항과 제3항의 처분에 대하여는 법원에 제소할 수 없다. 지방자치단체는
        주민의 복리에 관한 사무를 처리하고 재산을 관리하며, 법령의 범위안에서
        자치에 관한 규정을 제정할 수 있다.
      </li>
      <li>
        위원은 정당에 가입하거나 정치에 관여할 수 없다. 법관은 탄핵 또는 금고
        이상의 형의 선고에 의하지 아니하고는 파면되지 아니하며, 징계처분에
        의하지 아니하고는 정직·감봉 기타 불리한 처분을 받지 아니한다.
      </li>
      <li>
        법률이 정하는 주요방위산업체에 종사하는 근로자의 단체행동권은 법률이
        정하는 바에 의하여 이를 제한하거나 인정하지 아니할 수 있다.
        국민경제자문회의의 조직·직무범위 기타 필요한 사항은 법률로 정한다.
      </li>
      <li>
        국회는 의장 1인과 부의장 2인을 선출한다. 군인은 현역을 면한 후가 아니면
        국무위원으로 임명될 수 없다. 저작자·발명가·과학기술자와 예술가의 권리는
        법률로써 보호한다.
      </li>
      <li>
        민주평화통일자문회의의 조직·직무범위 기타 필요한 사항은 법률로 정한다.
        형사피고인은 유죄의 판결이 확정될 때까지는 무죄로 추정된다. 대한민국의
        주권은 국민에게 있고, 모든 권력은 국민으로부터 나온다.
      </li>
    </ul>
  );
};

export default Content;
